In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([[1,2,3],[2,7,3],[6,3,9]], columns=['A','B', 'C'])

In [3]:
df1

   A  B  C
0  1  2  3
1  2  7  3
2  6  3  9

In [10]:
df2 = pd.DataFrame([[11,2,31],[22,7,33],[76,3,97]], columns=['X','Y', 'Z'])

In [11]:
df2

    X  Y   Z
0  11  2  31
1  22  7  33
2  76  3  97

In [12]:
df3 = pd.merge(df1,df2, right_on='Y', left_on='B')

In [13]:
df3

   A  B  C   X  Y   Z
0  1  2  3  11  2  31
1  2  7  3  22  7  33
2  6  3  9  76  3  97

In [17]:
df2 = pd.DataFrame([[11,7,31],[22,2,33],[76,3,97]], columns=['X','Y', 'Z'])

In [18]:
df3 = pd.merge(df1,df2, right_on='Y', left_on='B')

In [19]:
df3

   A  B  C   X  Y   Z
0  1  2  3  22  2  33
1  2  7  3  11  7  31
2  6  3  9  76  3  97